# Assignment-6- Data Cleaning Assignments
##  By Syed Furquan Aziz

###  Problem Statement

Take this monstrosity as the DataFrame to use in the following puzzles:

	df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
	'londON_StockhOlm',
	'Budapest_PaRis', 'Brussels_londOn'],
	'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
	'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
	'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
	'12. Air France', '"Swiss Air"']})
	
     1. Some values in the the FlightNumber column are missing. These numbers are
     meant to increase by 10 with each row so 10055 and 10075 need to be put in
     place. Fill in these missing numbers and make the column an integer column
     (instead of a float column).
     2. The From_To column would be better as two separate columns! Split each
     string on the underscore delimiter _ to give a new temporary DataFrame with
     the correct values. Assign the correct column names to this temporary
     DataFrame.
     3. Notice how the capitalisation of the city names is all mixed up in this
     temporary DataFrame. Standardise the strings so that only the first letter is
     uppercase (e.g. "londON" should become "London".)
     4. Delete the From_To column from df and attach the temporary DataFrame
     from the previous questions.
     5. In the RecentDelays column, the values have been entered into the
     DataFrame as a list. We would like each first value in its own column, each
     second value in its own column, and so on. If there isn't an Nth value, the value
     should be NaN.
     Expand the Series of lists into a DataFrame named delays, rename the columns
     delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
     with delays.

In [102]:
import pandas as pd
import numpy as np

In [103]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)','(British Airways. )',
'12. Air France', '"Swiss Air"']})

##

## Solution 1

In [104]:
df   ###  Having a look at the dataframe created above

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [105]:
df.dtypes   ### Checking the datatypes of each columns

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [106]:
### Writing the logic to update the 'FlightNumber'
flightNoList = []
for i in range(0,len(df['FlightNumber'])):
    flightNoList.append(i*10+10045)
    
##  Updating the values of the 'FlightNumber' column in the dataframe
df['FlightNumber']=flightNoList

In [107]:
df   ## The values have been updated

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

##

## Solution 2

In [108]:
df.dtypes   ## the column has now been converted into 'integer'

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [109]:
df_to_from=pd.DataFrame()  ## creating a temporary dataframe as requested in question

df_to_from=df['From_To'].str.split('_', expand=True).rename(columns={0:'From', 1:'To'})    ## Updating the values as requested

In [110]:
df_to_from

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

##

## Solution 3

In [111]:
### capitalizing the columns as requested in
df_to_from['From']=df_to_from['From'].str.capitalize()
df_to_from['To']=df_to_from['To'].str.capitalize()

In [112]:
df_to_from

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

##

## Solution 4

In [113]:
df.drop(columns=['From_To'], inplace=True)   ## dropping the 'From_To' Column from the original dataframe

In [114]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [115]:
df=pd.concat([df,df_to_from], sort=False, axis=1)  ## Attaching the 'From' and 'To' column from the temporary dataframe created above

In [116]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

##

## Solution 5

#####   Will do this by two methods.
Method1:  Using pd.series

Method2: Using Dynamic assignment during program
    For this I would created a dynamic program to asses the length of each cell/('list') in RecentDelays column .
    and based on that length the values would be expanded in subsequent cells.
    For this we would compute the length of each element and max length and then create columns dynamically to fulfill the requirements of the question.

###  Method1

In [117]:
df[['RecentDelays_1','RecentDelays_2','RecentDelays_3']]= df.RecentDelays.apply(pd.Series)
df

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays_1,RecentDelays_2,RecentDelays_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

######

###  Method2

In [118]:

length=[]
for i in range(len(df['RecentDelays'])):
    #print(len(df.loc[i,'RecentDelays']))
    length.append(len(df.loc[i,'RecentDelays']))

In [119]:
print(length)
print(max(length))

[2, 0, 3, 1, 2]
3

In [120]:
for i in range(max(length)):
    df['RecentDelays_{}'.format(i)]=np.nan    ## initialising the column with nan values.
    for j in range(len(df['RecentDelays'])):
        df['RecentDelays_{}'.format(i)].iloc[j]=df['RecentDelays'].str[i][j]  ## Assigning relevant values to dynamically created cells

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [121]:
df

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays_1,RecentDelays_2,RecentDelays_3,RecentDelays_0
0,10045,"[23, 47]",KLM(!),London,Paris,47.0,NaN,NaN,23.0
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,43.0,87.0,87.0,24.0
3,10075,[13],12. Air France,Budapest,Paris,NaN,NaN,NaN,13.0
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,32.0,NaN,NaN,67.0